import { Plan, PlanSchema } from '@/readingPlans';

type Data = {
  date: string;
  praise: {
    scope: string;
    content: string;
  };
  devotional: {
    scope: string;
  };
};

export default class InMemoryPlanRepository implements Repository<Plan> {
  private db: Record<string, Data>;

  constructor(db = data) {
    this.db = db;
  }

  findById(date: string): Promise<Plan | null> {
    return Promise.resolve(this.db[date] ? PlanSchema.parse(this.db[date]) : null);
  }

  async all() {
    return Promise.resolve([]);
  }
  async save() {}
  async destroy() {}
}

const data: Record<string, Data> = {
  '2025-01-01': {
    date: '2025-01-01',
    praise: {
      scope: '歷代志上 16:34 CCB',
      content: '你們要稱謝耶和華，因為祂是美善的，祂的慈愛永遠長存！',
    },
    devotional: {
      scope: '出埃及記 第八章',
    },
  },
  '2025-01-02': {
    date: '2025-01-02',
    praise: {
      scope: '歷代志下 5:13 CCB',
      content:
        '吹號的和歌唱的都一致同聲地讚美稱謝耶和華。他們吹號、敲鈸，用各種樂器高聲讚美耶和華，說：“耶和華是良善的，他的慈愛永遠長存。”那時雲彩充滿了那殿，就是耶和華的殿。',
    },
    devotional: {
      scope: '出埃及記 第九章',
    },
  },
  '2025-01-03': {
    date: '2025-01-03',
    praise: {
      scope: '詩篇 7:17 CCB',
      content: '我要因耶和華公義而稱謝祂，我要歌頌至高者耶和華的名。',
    },
    devotional: {
      scope: '出埃及記 第十章',
    },
  },
  '2025-01-04': {
    date: '2025-01-04',
    praise: {
      scope: '詩篇 9:1-2 CCB',
      content:
        '我要一心稱謝耶和華；我要傳揚你一切奇妙的作為。我要因你歡喜快樂；至高者啊，我要歌頌你的名！',
    },
    devotional: {
      scope: '出埃及記 第十一章',
    },
  },
  '2025-01-05': {
    date: '2025-01-05',
    praise: {
      scope: '詩篇 9:11 CCB',
      content: '應當歌頌居錫安的耶和華，將祂所行的傳揚在眾民中。',
    },
    devotional: {
      scope: '出埃及記 第十二章',
    },
  },
  '2025-01-06': {
    date: '2025-01-06',
    praise: {
      scope: '詩篇 13:6 CCB',
      content: '我要向耶和華歌唱，因祂用厚恩待我。',
    },
    devotional: {
      scope: '出埃及記 第十三章',
    },
  },
  '2025-01-07': {
    date: '2025-01-07',
    praise: {
      scope: '歷代志上 29:10-13 CCB',
      content:
        '大衛在會眾面前頌讚耶和華，說：\n「我們先祖以色列的上帝耶和華啊,你永永遠遠當受頌讚！耶和華啊，偉大、權能、榮耀、尊貴和威嚴都是你的，天上地下的一切都是你的。耶和華啊，國度是你的，你是萬有的至高主宰。富貴和尊榮都從你而來，你掌管一切，你手中有權柄和能力，能使人尊大、強盛。我們的上帝啊，我們稱頌你，讚美你榮耀的名。',
    },
    devotional: {
      scope: '出埃及記 第十四章',
    },
  },
  '2025-01-08': {
    date: '2025-01-08',
    praise: {
      scope: '詩篇 145:1-3 CCB',
      content:
        '我的上帝，我的王啊！\n我要尊崇你，我要永永遠遠稱頌你的名。\n我要天天稱頌你，永永遠遠讚美你的名。\n耶和華是偉大的，當受至高的頌讚，祂的偉大無法測度。',
    },
    devotional: {
      scope: '出埃及記 第十五章',
    },
  },
  '2025-01-09': {
    date: '2025-01-09',
    praise: {
      scope: '詩篇 34:1-3 CCB',
      content:
        '我要常常稱頌耶和華，我的口時刻讚美祂。\n我因耶和華而誇耀，困苦人聽見必歡欣。\n要跟我們一同尊耶和華為大，讓我們一起尊崇祂的名！',
    },
    devotional: {
      scope: '出埃及記 第十六章',
    },
  },
  '2025-01-10': {
    date: '2025-01-10',
    praise: {
      scope: '詩篇 67:2-7 CCB',
      content:
        '上帝啊，願列邦讚美你，願萬族都稱頌你。\n願列國歡呼歌唱，因為你以公義審判列邦，引導世上的列國。\n上帝啊，願列邦讚美你，願萬族都稱頌你。大地出產豐富。\n上帝，我們的上帝要賜福我們。\n上帝要賜福我們，普天下都要敬畏祂。',
    },
    devotional: {
      scope: '出埃及記 第十七章',
    },
  },
  '2025-01-11': {
    date: '2025-01-11',
    praise: {
      scope: '詩篇 67:5-7 CCB',
      content:
        '上帝啊，願列邦讚美你，願萬族都稱頌你。\n大地出產豐富。上帝，我們的上帝要賜福我們。\n上帝要賜福我們，普天下都要敬畏祂。',
    },
    devotional: {
      scope: '出埃及記 第十八章',
    },
  },
  '2025-01-12': {
    date: '2025-01-12',
    praise: {
      scope: '詩篇 145:1-3 CCB',
      content:
        '我的上帝，我的王啊！\n我要尊崇你，我要永永遠遠稱頌你的名。\n我要天天稱頌你，永永遠遠讚美你的名。\n耶和華是偉大的，當受至高的頌讚，祂的偉大無法測度。',
    },
    devotional: {
      scope: '出埃及記 第十九章',
    },
  },
  '2025-01-13': {
    date: '2025-01-13',
    praise: {
      scope: '詩篇 147:1 CCB',
      content: '你們要讚美耶和華！歌頌我們的上帝，真是美好！\n讚美祂，真是快樂合宜！',
    },
    devotional: {
      scope: '出埃及記 第二十章',
    },
  },
  '2025-01-14': {
    date: '2025-01-14',
    praise: {
      scope: '歷代志上 29:11-13 CCB',
      content:
        '耶和華啊，偉大、權能、榮耀、尊貴和威嚴都是你的，天上地下的一切都是你的。耶和華啊，國度是你的，你是萬有的至高主宰。富貴和尊榮都從你而來，你掌管一切，你手中有權柄和能力，能使人尊大、強盛。我們的上帝啊，我們稱頌你，讚美你榮耀的名。',
    },
    devotional: {
      scope: '出埃及記 第二十一章',
    },
  },
  '2025-01-15': {
    date: '2025-01-15',
    praise: {
      scope: '詩篇 100 CCB',
      content:
        '普世要向耶和華歡呼！你們要歡然事奉耶和華，到祂面前來歡唱。\n要知道耶和華是上帝，祂創造了我們，我們屬於祂，是祂的子民，是祂草場上的羊。要懷著感恩的心進入祂的門，唱著讚美的歌進入祂的院宇；要感謝祂，稱頌祂的名。因為耶和華是美善的，祂的慈愛永遠長存，祂的信實千古不變。',
    },
    devotional: {
      scope: '出埃及記 第二十二章',
    },
  },
  '2025-01-16': {
    date: '2025-01-16',
    praise: {
      scope: '詩篇 104:1-5 CCB',
      content:
        '我的心啊，要稱頌耶和華。我的上帝耶和華啊，你是多麼偉大！\n你以尊貴和威嚴為衣，你身披光華如披外袍，你鋪展穹蒼如鋪幔子。\n祂在水上立起樓閣的棟梁。祂以雲彩為車駕，乘風飛馳。\n祂以風為使者，以火焰為僕役。\n祂將大地立在根基上，使它永不動搖。',
    },
    devotional: {
      scope: '出埃及記 第二十三章',
    },
  },
  '2025-01-17': {
    date: '2025-01-17',
    praise: {
      scope: '詩篇 104:31-35 CCB',
      content:
        '願耶和華的榮耀存到永遠！願耶和華以祂的創造為樂！\n祂一看大地，大地就震動；祂一摸群山，群山就冒煙。\n我要一生一世向耶和華歌唱，我一息尚存就要讚美我的上帝。\n願祂喜悅我的默想，耶和華是我的喜樂。\n願罪人從地上消逝，願惡人蕩然無存。\n我的心啊，要稱頌耶和華！你們要讚美耶和華！',
    },
    devotional: {
      scope: '出埃及記 第二十四章',
    },
  },
  '2025-01-18': {
    date: '2025-01-18',
    praise: {
      scope: '詩篇 66:1-4 CCB',
      content:
        '普世啊，你們要向上帝歡呼，頌讚祂榮耀的名，獻給祂榮耀的讚美。\n要對上帝說：「你的作為令人敬畏！你的大能使敵人屈膝投降。\n普天下都敬拜你，頌讚你，頌讚你的名。」',
    },
    devotional: {
      scope: '出埃及記 第二十五章',
    },
  },
  '2025-01-19': {
    date: '2025-01-19',
    praise: {
      scope: '詩篇 135:3 CCB',
      content:
        '你們要讚美耶和華，因為祂是美善的；\n你們要歌頌祂的名，因為祂的名美好無比。\n祂揀選雅各做祂的子民，揀選以色列作祂的產業。\n我知道耶和華偉大，我們的主超越一切神明。',
    },
    devotional: {
      scope: '出埃及記 第二十六章',
    },
  },
  '2025-01-20': {
    date: '2025-01-20',
    praise: {
      scope: '詩篇 89:1-2 CCB',
      content:
        '我要永遠稱頌耶和華的慈愛！\n我的口要傳揚你的信實直到萬代。\n我要宣告：你的慈愛存到永遠,你的信實堅立在天。',
    },
    devotional: {
      scope: '出埃及記 第二十七章',
    },
  },
  '2025-01-21': {
    date: '2025-01-21',
    praise: {
      scope: '詩篇 89:1-11 CCB',
      content:
        '耶和華啊，諸天要頌揚你的奇妙，眾聖者要同聚讚美你的信實。\n天上有誰能與耶和華相比，眾天使中誰能像祂？\n祂在眾聖者的會中大受敬畏，祂的威嚴無與倫比。\n萬軍之上帝耶和華啊，誰能像你能力偉大，信實無比？\n你掌管洶湧的大海，平息驚濤駭浪。你擊碎海怪，使其斃命，以大能的臂膀驅散仇敵。天地都屬於你，世界和其中的一切都是你造的。',
    },
    devotional: {
      scope: '出埃及記 第二十八章',
    },
  },
  '2025-01-22': {
    date: '2025-01-22',
    praise: {
      scope: '詩篇 135:3 CCB',
      content: '你們要讚美耶和華，因為祂是美善的；你們要歌頌祂的名，因為祂的名美好無比。',
    },
    devotional: {
      scope: '出埃及記 第二十九章',
    },
  },
  '2025-01-23': {
    date: '2025-01-23',
    praise: {
      scope: '詩篇 103:1-5 CCB',
      content:
        '我的心啊，要稱頌耶和華，我的肺腑心腸啊，要稱頌祂的聖名。\n我的心啊，要稱頌耶和華，不要忘記祂的一切恩惠。\n祂赦免你一切的罪惡，醫治你一切的疾病。\n祂救贖你的生命脫離死亡，以慈愛和憐憫環繞你。\n祂以美物滿足你的願望，使你如鷹一般恢復青春。',
    },
    devotional: {
      scope: '出埃及記 第三十章',
    },
  },
  '2025-01-24': {
    date: '2025-01-24',
    praise: {
      scope: '詩篇 103:19-22 CCB',
      content:
        '耶和華在天上設立了寶座，祂的王權統管萬有。\n聽從耶和華的命令、遵行祂吩咐的大能天使啊，你們要稱頌祂！\n事奉耶和華、遵從祂旨意的天軍啊，你們要稱頌祂！\n耶和華所造的萬物啊，要在祂掌管的各處稱頌祂。\n我的心啊，要稱頌耶和華！',
    },
    devotional: {
      scope: '出埃及記 第三十一章',
    },
  },
  '2025-01-25': {
    date: '2025-01-25',
    praise: {
      scope: '詩篇 145:1-3 CCB',
      content:
        '我的上帝，我的王啊！\n我要尊崇你，我要永永遠遠稱頌你的名。\n我要天天稱頌你，永永遠遠讚美你的名。\n耶和華是偉大的，當受至高的頌讚，祂的偉大無法測度。',
    },
    devotional: {
      scope: '出埃及記 第三十二章',
    },
  },
  '2025-01-26': {
    date: '2025-01-26',
    praise: {
      scope: '詩篇 145:8-13 CCB',
      content:
        '耶和華有恩典、好憐憫，不輕易發怒，充滿慈愛。\n耶和華善待眾生，憐憫祂所造的萬物。\n耶和華啊，你所創造的萬物都要稱謝你，你忠心的子民也要頌揚你。\n他們要述說你國度的榮耀，講論你的大能，\n好讓世人知道你大能的作為和你國度的威嚴與榮耀。\n你的國度永遠長存，你的統治直到萬代。',
    },
    devotional: {
      scope: '出埃及記 第三十三章',
    },
  },
  '2025-01-27': {
    date: '2025-01-27',
    praise: {
      scope: '詩篇 66:1-4 CCB',
      content:
        '普世啊，你們要向上帝歡呼，頌讚祂榮耀的名，獻給祂榮耀的讚美。\n要對上帝說：「你的作為令人敬畏！你的大能使敵人屈膝投降。\n普天下都敬拜你，頌讚你，頌讚你的名。」',
    },
    devotional: {
      scope: '出埃及記 第三十四章',
    },
  },
  '2025-01-28': {
    date: '2025-01-28',
    praise: {
      scope: '詩篇 66:5-8 CCB',
      content:
        '你們來看看上帝的作為，祂為世人行了可畏之事！\n祂將滄海變為乾地，讓百姓步行經過。\n讓我們因祂而歡欣吧！\n祂以大能永遠掌權，祂的眼目鑒察列國，\n悖逆之徒不可在祂面前妄自尊大。\n列邦啊，要讚美我們的上帝，讓歌頌祂的聲音四處飄揚。',
    },
    devotional: {
      scope: '出埃及記 第三十五章',
    },
  },
  '2025-01-29': {
    date: '2025-01-29',
    praise: {
      scope: '詩篇 145:10-13 CCB',
      content:
        '耶和華啊，你所創造的萬物都要稱謝你，\n你忠心的子民也要頌揚你。\n他們要述說你國度的榮耀，講論你的大能，\n好讓世人知道你大能的作為和你國度的威嚴與榮耀。\n你的國度永遠長存，你的統治直到萬代。',
    },
    devotional: {
      scope: '出埃及記 第三十六章',
    },
  },
  '2025-01-30': {
    date: '2025-01-30',
    praise: {
      scope: '詩篇 113:1-5 CCB',
      content:
        '你們要讚美耶和華！耶和華的僕人啊，\n你們要讚美，讚美耶和華的名。\n願耶和華的名受稱頌，從現在直到永遠！\n從日出之地到日落之處，普世都應當讚美耶和華的名。\n耶和華高居萬國之上，祂的榮耀高過諸天。\n誰能與我們的上帝耶和華相比?',
    },
    devotional: {
      scope: '出埃及記 第三十七章',
    },
  },
  '2025-01-31': {
    date: '2025-01-31',
    praise: {
      scope: '詩篇 115:16-18 CCB',
      content:
        '高天屬於耶和華，但祂把大地賜給了世人。\n死人不能頌讚耶和華，下墳墓的人不能讚美祂。\n但我們要讚美耶和華，從現在直到永遠。\n你們要讚美耶和華！',
    },
    devotional: {
      scope: '出埃及記 第三十八章',
    },
  },
};
